app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all.order(age: :asc)
---
SELECT "accounts".* FROM "accounts"  ORDER BY "accounts"."age" ASC

  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save
---
INSERT INTO "accounts" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "HomerSimp"], ["age", 38], ["created_at", "2016-06-10 12:01:39.263415"], ["updated_at", "2016-06-10 12:01:39.263415"]]

  def destroy
    @account.destroy
---
DELETE FROM "accounts" WHERE "accounts"."id" = $1  [["id", 2]]