app/controllers/carts_controller.rb

SELECT "products".* FROM "products" WHERE "products"."cart_id" = $1  [["cart_id", 1]]
---
  def show
    @products_in_cart = Product.where(cart_id: session[:cart_id])

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
---
  def add
    Cart.find(session[:cart_id]).products << Product.find(params[:product_id])