app/controllers/friendships_controller.rb

SELECT "friendships".* FROM "friendships"
---
  def index
    @friendships = Friendship.all