app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ewqrq"], ["description", "wqerqr"], ["price", 123.0], ["created_at", "2016-06-14 17:20:17.434399"], ["updated_at", "2016-06-14 17:20:17.434399"]]
---
  def create
    @product = Product.new(product_params)

    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "products" SET "description" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["description", "dsads"], ["updated_at", "2016-06-10 16:58:27.167120"], ["id", 1]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(name: params[:name], description: params[:description])